benchmarks/2026-05-26_00-29-42_pgbench_scx_mitosis/pgbench_out.log
pgbench (18.3)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: simple
number of clients: 15
number of threads: 8
maximum number of tries: 1
number of transactions per client: 3000
number of transactions actually processed: 45000/45000
number of failed transactions: 0 (0.000%)
latency average = 6.131 ms
initial connection time = 11.262 ms
tps = 2446.694812 (without initial connection time)